{
  "A": {
    "repo": "upstage/Solar-Open-100B",
    "config_summary": {
      "model_type": "solar_open",
      "architectures": [
        "SolarOpenForCausalLM"
      ],
      "hidden_size": 4096,
      "num_hidden_layers": 48,
      "num_attention_heads": 64,
      "num_key_value_heads": 8,
      "intermediate_size": 10240,
      "moe_intermediate_size": 1280,
      "n_routed_experts": 128,
      "n_shared_experts": 1,
      "num_experts_per_tok": 8,
      "max_position_embeddings": 131072,
      "rope_theta": 1000000,
      "partial_rotary_factor": 1.0,
      "first_k_dense_replace": 0,
      "vocab_size": 196608,
      "pad_token_id": 2,
      "bos_token_id": 1,
      "eos_token_id": 2,
      "tie_word_embeddings": false,
      "torch_dtype": "bfloat16",
      "transformers_version": "4.57.1"
    }
  },
  "B": {
    "repo": "zai-org/GLM-4.5-Air",
    "config_summary": {
      "model_type": "glm4_moe",
      "architectures": [
        "Glm4MoeForCausalLM"
      ],
      "hidden_size": 4096,
      "num_hidden_layers": 46,
      "num_attention_heads": 96,
      "num_key_value_heads": 8,
      "intermediate_size": 10944,
      "moe_intermediate_size": 1408,
      "n_routed_experts": 128,
      "n_shared_experts": 1,
      "num_experts_per_tok": 8,
      "max_position_embeddings": 131072,
      "rope_theta": 1000000,
      "partial_rotary_factor": 0.5,
      "first_k_dense_replace": 1,
      "vocab_size": 151552,
      "pad_token_id": 151329,
      "eos_token_id": [
        151329,
        151336,
        151338
      ],
      "num_nextn_predict_layers": 1,
      "tie_word_embeddings": false,
      "torch_dtype": "bfloat16",
      "transformers_version": "4.54.0"
    }
  }
}